In [1]:
import warnings
warnings.filterwarnings('ignore')

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
import requests

url = "https://dhakahouserents.s3.ap-southeast-1.amazonaws.com/bproperties_dhaka_house_rents.zip"
data = requests.get(url)
data

In [4]:
import zipfile
import os

if data.status_code == 200:  # Check for successful download
    os.makedirs("data_ingestion", exist_ok = True)
    
    with open("data.zip", "wb") as f:
        f.write(data.content)

    with zipfile.ZipFile("data.zip", 'r') as zip_ref:
        zip_ref.extractall("data_ingestion")  # Extract all files from the ZIP archive

    print("ZIP file downloaded and extracted successfully!")
else:
    print(f"Download failed. Status code: {data.status_code}")

ZIP file downloaded and extracted successfully!

In [5]:
df = pd.read_csv("data_ingestion/houserentdhaka.csv")

In [6]:
df.shape

(28800, 6)

In [7]:
df.head(3)

,Unnamed: 0,Location,Area,Bed,Bath,Price
0,0,"Block H, Bashundhara R-A, Dhaka","1,600 sqft",3,3,20 Thousand
1,1,"Farmgate, Tejgaon, Dhaka",900 sqft,2,2,20 Thousand
2,2,"Block B, Nobodoy Housing Society, Mohammadpur,...","1,250 sqft",3,3,18 Thousand

In [8]:
df.drop("Unnamed: 0", axis=1, inplace = True)

In [9]:
df.head()

,Location,Area,Bed,Bath,Price
0,"Block H, Bashundhara R-A, Dhaka","1,600 sqft",3,3,20 Thousand
1,"Farmgate, Tejgaon, Dhaka",900 sqft,2,2,20 Thousand
2,"Block B, Nobodoy Housing Society, Mohammadpur,...","1,250 sqft",3,3,18 Thousand
3,"Gulshan 1, Gulshan, Dhaka","2,200 sqft",3,4,75 Thousand
4,"Baridhara, Dhaka","2,200 sqft",3,3,75 Thousand

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28800 entries, 0 to 28799
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Location  28800 non-null  object
 1   Area      28800 non-null  object
 2   Bed       28800 non-null  int64
 3   Bath      28800 non-null  int64
 4   Price     28800 non-null  object
dtypes: int64(2), object(3)
memory usage: 1.1+ MB

## Pre-Process the Location Column

In [11]:
def preprocess_location(address):
    address = address.lower()
    location_arr = address.split(', ')
    location = location_arr[-2] if len(location_arr)> 1 else None
    return location 

df["location"] = df["Location"].apply(preprocess_location)

In [12]:
df["location"].unique()

array(['bashundhara r-a', 'tejgaon', 'mohammadpur', 'gulshan',
       'baridhara', 'hazaribag', 'mirpur', 'nikunja', 'uttara',
       'khilgaon', 'ibrahimpur', 'badda', 'adabor', 'jatra bari',
       'malibagh', 'banani', 'kakrail', 'dhanmondi', 'maghbazar',
       'kalachandpur', 'niketan', 'eskaton', 'banasree', 'bashabo',
       'baridhara dohs', 'aftab nagar', 'lalmatia', 'dakshin khan',
       'mohakhali dohs', 'sutrapur', 'hatirpool', 'agargaon', 'rampura',
       'cantonment', 'shahbagh', 'khilkhet', 'motijheel', 'shantinagar',
       'shegunbagicha', 'kathalbagan', 'shyamoli', 'kalabagan', 'demra',
       'kuril', 'mohakhali', 'lalbagh', 'new market', 'kafrul',
       'kachukhet', 'turag', None, 'nadda', 'shyampur', 'maniknagar',
       'banani dohs', 'shiddheswari', 'bangshal', 'paribagh',
       'joar sahara', 'mugdapara', 'north shahjahanpur', 'kotwali',
       'shahjahanpur', 'uttar khan', 'taltola', 'sadarghat',
       'banglamotors', 'zafrabad', 'keraniganj'], dtype=object)

In [13]:
df["location"].isnull().sum()

13

## Pre-Process the Area Column

In [14]:
df['Area']

0        1,600 sqft
1          900 sqft
2        1,250 sqft
3        2,200 sqft
4        2,200 sqft
            ...
28795    1,400 sqft
28796    1,400 sqft
28797    1,250 sqft
28798    1,900 sqft
28799    1,150 sqft
Name: Area, Length: 28800, dtype: object

In [15]:
import re
def preprocess_area(text):
#     text = text.strip()
    text = text.replace(',', '')
    match = re.search(r'\d+', text)
    if match:
        return int(match.group())

In [16]:
df['area_sqft'] = df['Area'].apply(preprocess_area)

In [17]:
df['area_sqft']

0        1600
1         900
2        1250
3        2200
4        2200
         ...
28795    1400
28796    1400
28797    1250
28798    1900
28799    1150
Name: area_sqft, Length: 28800, dtype: int64

In [18]:
df['area_sqft'].unique()

array([1600,  900, 1250, 2200, 3000, 2300,  950, 1150, 1300,  750, 1850,
       1200, 1050, 1400, 2100,  800, 1500,  650, 1524, 1100, 3500,  850,
       1750, 1617, 1350, 1900, 2600, 1860, 3200, 1895, 1360, 1000, 1800,
       2150, 2000, 3680, 1058, 2420, 1650, 2700, 2660, 1570, 3245,  745,
       2400,  600, 1180, 2550, 2025, 1450, 2359, 2021, 2960,  720, 1550,
        700, 2750,  500, 4200, 1057, 2250,  400, 1385, 2800, 1700,  550,
       1612, 1890, 1760, 5500, 1393, 2500,  870, 1665, 1530, 3750, 1320,
       1372, 2450, 2720, 2840, 1778, 1776, 1410, 4500, 1663, 1950, 4700,
       2015, 1943, 1710, 3300, 1215, 2050, 1480, 3100, 1165, 2075, 1875,
       1075, 4000,  970, 1765, 3800, 1810,  980, 1580, 2045, 1735, 2900,
       2350, 1830, 1654,  880, 3346, 1270, 1124, 5000, 1980, 1625, 1170,
       1730, 1485,  760, 2091,  725, 3950, 2201, 3600, 1975, 1660, 5800,
       1675, 2580, 1240, 1442, 1375, 1465, 6300, 2146, 1888,  200, 4300,
       2775, 3244,  780, 1020,  920, 1285, 1325, 1390, 1585, 2977, 2535,
        860, 3515, 1703, 2410, 1921, 1329, 1003, 1560, 1460, 1620, 2440,
       2716, 2320, 1245, 1380, 2520, 1576, 1160, 2275, 1685, 1080, 1520,
       1490, 2270, 2950,  960, 2225, 1286, 2650, 2008, 1644, 1175, 1565,
       1960, 1563, 3013, 1185,  450,  350, 1156, 1670, 3187, 1235, 1525,
       1880, 1254, 1616, 1985, 3144, 1553, 2475, 1494, 1704, 1885, 2488,
        989, 2004, 2170, 2130, 1336, 1785, 2020, 1052, 4138, 2570, 2595,
       1369, 1220, 1340,  670, 1265, 2685, 1910, 5400, 1680, 1721, 1870,
       1230,  300, 3850, 1594,  830, 2575, 4100, 1470, 1790, 1072, 2223,
       1435, 1725, 1535, 1298,  965, 2260, 1876, 2525, 2084, 1425, 3715,
       4350, 1370,  820, 1440, 2165, 2642, 3400,  580, 2058, 1610, 2460,
       1661, 1540, 2175, 1280, 1770, 1257, 1171, 2140, 1430, 1126, 1040,
        729, 1086, 1444, 1740, 3650,  930,  875, 1260, 1120, 1640,  680,
       1643, 3450, 1887,  250, 1575, 1970, 1872, 1210, 1527, 1451,  570,
       1345, 1315, 1308, 1275, 1886, 1510, 2070, 1121, 1693, 1119,  927,
        775, 2377, 1679,  971, 1630, 1840, 1543,  675, 1475,  975, 2850,
       1541,  948,  620, 2060, 4600,  955,  767, 1762, 3554,  770, 1420,
        940,  730, 1115, 1514, 1690, 1213, 1125,  832, 1554, 1130, 1084,
       1225,  848, 1009,  990, 1228, 1082,  835, 1732, 1674,  845, 1060,
       1010,  856, 2530, 1940, 1110, 1233, 1055, 1925,  825,  840, 1653,
       1330, 1365, 1856, 2495, 1990,  910, 2009, 1347, 1271, 2238,  520,
       1866, 1395, 1405, 2358, 1476, 1569, 1343, 1727, 1116,  790, 1367,
       1290, 1077, 1441, 1187, 1482, 1384, 1590, 1556, 1145, 1030,  630,
        685,  710,  480, 1438, 1920, 1515, 2787, 1005, 1090, 1144, 1205,
       1557, 2730, 1820, 1695,  560, 1114,  956, 1526, 2167, 2385, 1319,
       1256,  660, 1448, 1734,  420, 1487, 1166,  815, 2573, 1105, 1316,
       2180, 4099,  890, 2134, 2035, 1025, 1355,  968, 2160, 2040, 1548,
       1038, 1745, 1495, 1780, 2370, 2065, 1045, 2430, 4400, 1190, 1754,
       2240, 1070, 2735, 1965, 1135,  925,  765, 1133, 1865, 2515, 2330,
       1671, 1301, 1775, 2120, 1244,  810, 1056, 4800, 1826, 1085,  585,
       1140, 2210, 1455, 1825, 3267, 2179, 2026, 1158, 2135,  625, 4550,
       2290, 1332, 1486, 1134, 1456, 1424, 1589, 1718, 1469, 1636, 2585,
       1136,  740,  862, 1335, 2220, 1349, 1720, 1212, 1267, 1635,  530,
       2080,  470,  665,  632, 1318, 3900, 1483, 1164, 1658, 1128, 1168,
       1278, 1127, 1712, 1595, 2148, 1645, 1377, 2106, 1896, 1117, 1242,
       1915, 1417,  938,  905, 1705, 2340, 2915,  752, 1310, 1474,  763,
        595, 1222, 1528, 2680, 2125, 1428,  996, 2010, 2024, 1344, 1065,
       1415,  895, 1606, 1758, 1255, 1945, 1505, 1152, 1076, 1095, 2285,
       4050,  715, 2810, 2970, 1855, 1677, 1611, 1726, 1021, 2229, 1805,
       1305, 1445, 1155, 2510, 1227, 1237, 2137, 2759, 1204, 1276, 2228,
       1922, 2312,  540, 1587, 1006, 2318,  855,  987, 1226, 1614, 1842,
       2246, 2190], dtype=int64)

## Pre-Process the Price Column

In [19]:
df['Price'].unique()

array(['20 Thousand', '18 Thousand', '75 Thousand', '50 Thousand',
       '14 Thousand', '28 Thousand', '19 Thousand', '40 Thousand',
       '60 Thousand', '16 Thousand', '35 Thousand', '1.6 Lakh',
       '25 Thousand', '30 Thousand', '18.63 Thousand', '32 Thousand',
       '1 Lakh', '2 Lakh', '10 Thousand', '15 Thousand', '27 Thousand',
       '24 Thousand', '38 Thousand', '80 Thousand', '1.5 Lakh',
       '1.2 Lakh', '26 Thousand', '45 Thousand', '85 Thousand',
       '13 Thousand', '1.1 Lakh', '24.76 Thousand', '17 Thousand',
       '95 Thousand', '55 Thousand', '31 Thousand', '2.4 Lakh',
       '54 Thousand', '90 Thousand', '42 Thousand', '1.4 Lakh',
       '33 Thousand', '8.5 Thousand', '11 Thousand', '12 Thousand',
       '4 Lakh', '65 Thousand', '36 Thousand', '70 Thousand',
       '52.5 Thousand', '2.5 Lakh', '5 Thousand', '3.5 Lakh', '1.15 Lakh',
       '15.5 Thousand', '36.75 Thousand', '33.5 Thousand', '3 Lakh',
       '22 Thousand', '12.5 Thousand', '2.15 Lakh', '7 Thousand',
       '13.5 Thousand', '2.8 Lakh', '39 Thousand', '11.5 Thousand',
       '6.5 Thousand', '1.35 Lakh', '1.3 Lakh', '21 Thousand',
       '45.5 Thousand', '16.53 Thousand', '17.5 Thousand', '7.5 Thousand',
       '57 Thousand', '19.26 Thousand', '67.5 Thousand', '23 Thousand',
       '9 Thousand', '16.5 Thousand', '34 Thousand', '37 Thousand',
       '28.5 Thousand', '48 Thousand', '18.5 Thousand', '24.5 Thousand',
       '34.5 Thousand', '1.25 Lakh', '1.7 Lakh', '14.5 Thousand',
       '6.5 Lakh', '10.5 Thousand', '52 Thousand', '37.5 Thousand',
       '8 Thousand', '17.99 Thousand', '1.8 Lakh', '1.85 Lakh',
       '2.7 Lakh', '18.2 Thousand', '51 Thousand', '17.48 Thousand',
       '29 Thousand', '26.5 Thousand', '44 Thousand', '43 Thousand',
       '56 Thousand', '6.3 Thousand', '60.15 Thousand', '4.5 Lakh',
       '18.65 Thousand', '25.5 Thousand', '23.5 Thousand',
       '19.5 Thousand', '24.78 Thousand', '22.5 Thousand',
       '17.2 Thousand', '22.8 Thousand', '2.2 Lakh', '59 Thousand',
       '18.1 Thousand', '43.75 Thousand', '26.25 Thousand',
       '13.53 Thousand', '5.5 Thousand', '30.5 Thousand', '40.5 Thousand',
       '16.18 Thousand', '3.2 Lakh', '79 Thousand', '9.5 Thousand',
       '29.9 Thousand', '13.7 Thousand', '16.57 Thousand',
       '13.6 Thousand', '1.66 Lakh', '13.2 Thousand', '30.1 Thousand',
       '20.5 Thousand', '10.65 Thousand', '15.6 Thousand', '47 Thousand',
       '17.8 Thousand', '16.05 Thousand', '12.7 Thousand',
       '21.5 Thousand', '15.4 Thousand', '18.68 Thousand',
       '15.3 Thousand', '41 Thousand', '14.2 Thousand', '17.3 Thousand',
       '32.5 Thousand', '18.7 Thousand', '15.1 Thousand', '27.5 Thousand',
       '16.2 Thousand', '11.6 Thousand', '46 Thousand', '25.6 Thousand',
       '10.7 Thousand', '16.7 Thousand', '12.8 Thousand', '12.4 Thousand',
       '62 Thousand', '19.3 Thousand', '12.3 Thousand', '10.6 Thousand',
       '41.5 Thousand', '9.8 Thousand', '11.28 Thousand', '45.2 Thousand',
       '8.3 Thousand', '17.7 Thousand', '24.3 Thousand', '42.5 Thousand',
       '43.5 Thousand', '21.7 Thousand', '14.47 Thousand',
       '14.7 Thousand', '44.5 Thousand', '53 Thousand', '9.6 Thousand',
       '10.55 Thousand', '13.9 Thousand', '15.7 Thousand',
       '35.5 Thousand', '1.65 Lakh', '8.6 Thousand', '25.75 Thousand',
       '58 Thousand', '16.3 Thousand', '15.2 Thousand', '29.5 Thousand',
       '17.24 Thousand', '10.8 Thousand', '13.63 Thousand',
       '20.2 Thousand', '16.07 Thousand', '16.8 Thousand',
       '10.2 Thousand', '38.5 Thousand', '16.27 Thousand',
       '22.7 Thousand', '2.6 Lakh', '17.25 Thousand', '12.2 Thousand',
       '13.38 Thousand', '11.7 Thousand', '12.1 Thousand',
       '20.4 Thousand', '16.9 Thousand', '13.8 Thousand', '17.1 Thousand',
       '21.18 Thousand', '14.15 Thousand', '20.6 Thousand',
       '19.68 Thousand', '4.8 Lakh', '18.6 Thousand', '13.3 Thousand',
       '7.7 Thousand', '47.5 Thousand'], dtype=object)

In [20]:
def extract_price(price_str):
    text = str(price_str).strip()
    text = text.replace(',', '')
    # Define conversion factors
    conversion_factors = {
        'Thousand': 1000,
        'Lakh': 100000,
        'Cr': 10000000
    }
    
    # Check for 'Lac' and 'Cr' and handle them
    for unit, factor in conversion_factors.items():
        if unit in text:
            match = re.search(r'\d+(\.\d+)?', text)
            if match:
                return float(match.group()) * factor
    
    # Handle the case with pure numbers and numbers followed by other text
    match = re.search(r'\d+(\.\d+)?', text)
    if match:
        return int(match.group())
    
    return None

In [21]:
df['avg_rent'] = df['Price'].apply(extract_price)

In [22]:
df['avg_rent'].unique()

array([ 20000.,  18000.,  75000.,  50000.,  14000.,  28000.,  19000.,
        40000.,  60000.,  16000.,  35000., 160000.,  25000.,  30000.,
        18630.,  32000., 100000., 200000.,  10000.,  15000.,  27000.,
        24000.,  38000.,  80000., 150000., 120000.,  26000.,  45000.,
        85000.,  13000., 110000.,  24760.,  17000.,  95000.,  55000.,
        31000., 240000.,  54000.,  90000.,  42000., 140000.,  33000.,
         8500.,  11000.,  12000., 400000.,  65000.,  36000.,  70000.,
        52500., 250000.,   5000., 350000., 115000.,  15500.,  36750.,
        33500., 300000.,  22000.,  12500., 215000.,   7000.,  13500.,
       280000.,  39000.,  11500.,   6500., 135000., 130000.,  21000.,
        45500.,  16530.,  17500.,   7500.,  57000.,  19260.,  67500.,
        23000.,   9000.,  16500.,  34000.,  37000.,  28500.,  48000.,
        18500.,  24500.,  34500., 125000., 170000.,  14500., 650000.,
        10500.,  52000.,  37500.,   8000.,  17990., 180000., 185000.,
       270000.,  18200.,  51000.,  17480.,  29000.,  26500.,  44000.,
        43000.,  56000.,   6300.,  60150., 450000.,  18650.,  25500.,
        23500.,  19500.,  24780.,  22500.,  17200.,  22800., 220000.,
        59000.,  18100.,  43750.,  26250.,  13530.,   5500.,  30500.,
        40500.,  16180., 320000.,  79000.,   9500.,  29900.,  13700.,
        16570.,  13600., 166000.,  13200.,  30100.,  20500.,  10650.,
        15600.,  47000.,  17800.,  16050.,  12700.,  21500.,  15400.,
        18680.,  15300.,  41000.,  14200.,  17300.,  32500.,  18700.,
        15100.,  27500.,  16200.,  11600.,  46000.,  25600.,  10700.,
        16700.,  12800.,  12400.,  62000.,  19300.,  12300.,  10600.,
        41500.,   9800.,  11280.,  45200.,   8300.,  17700.,  24300.,
        42500.,  43500.,  21700.,  14470.,  14700.,  44500.,  53000.,
         9600.,  10550.,  13900.,  15700.,  35500., 165000.,   8600.,
        25750.,  58000.,  16300.,  15200.,  29500.,  17240.,  10800.,
        13630.,  20200.,  16070.,  16800.,  10200.,  38500.,  16270.,
        22700., 260000.,  17250.,  12200.,  13380.,  11700.,  12100.,
        20400.,  16900.,  13800.,  17100.,  21180.,  14150.,  20600.,
        19680., 480000.,  18600.,  13300.,   7700.,  47500.])

In [23]:
df.head(3)

,Location,Area,Bed,Bath,Price,location,area_sqft,avg_rent
0,"Block H, Bashundhara R-A, Dhaka","1,600 sqft",3,3,20 Thousand,bashundhara r-a,1600,20000.0
1,"Farmgate, Tejgaon, Dhaka",900 sqft,2,2,20 Thousand,tejgaon,900,20000.0
2,"Block B, Nobodoy Housing Society, Mohammadpur,...","1,250 sqft",3,3,18 Thousand,mohammadpur,1250,18000.0

In [24]:
df.head(50)

,Location,Area,Bed,Bath,Price,location,area_sqft,avg_rent
0,"Block H, Bashundhara R-A, Dhaka","1,600 sqft",3,3,20 Thousand,bashundhara r-a,1600,20000.0
1,"Farmgate, Tejgaon, Dhaka",900 sqft,2,2,20 Thousand,tejgaon,900,20000.0
2,"Block B, Nobodoy Housing Society, Mohammadpur,...","1,250 sqft",3,3,18 Thousand,mohammadpur,1250,18000.0
3,"Gulshan 1, Gulshan, Dhaka","2,200 sqft",3,4,75 Thousand,gulshan,2200,75000.0
4,"Baridhara, Dhaka","2,200 sqft",3,3,75 Thousand,baridhara,2200,75000.0
5,"Bashundhara R-A, Dhaka","3,000 sqft",4,5,50 Thousand,bashundhara r-a,3000,50000.0
6,"Baridhara, Dhaka","2,300 sqft",3,3,75 Thousand,baridhara,2300,75000.0
7,"PC Culture Housing, Mohammadpur, Dhaka",950 sqft,2,2,14 Thousand,mohammadpur,950,14000.0
8,"Jigatola, Hazaribag, Dhaka","1,600 sqft",3,3,28 Thousand,hazaribag,1600,28000.0
9,"West Kazipara, Mirpur, Dhaka","1,150 sqft",3,3,19 Thousand,mirpur,1150,19000.0
10,"Block D, Bashundhara R-A, Dhaka","1,300 sqft",3,3,40 Thousand,bashundhara r-a,1300,40000.0
11,"Block J, Bashundhara R-A, Dhaka","1,250 sqft",3,3,19 Thousand,bashundhara r-a,1250,19000.0
12,"Block D, Bashundhara R-A, Dhaka","1,300 sqft",3,3,60 Thousand,bashundhara r-a,1300,60000.0
13,"Nikunja 2, Nikunja, Dhaka",750 sqft,2,2,16 Thousand,nikunja,750,16000.0
14,"Sector 6, Uttara, Dhaka","1,850 sqft",3,3,40 Thousand,uttara,1850,40000.0
15,"Block D, Bashundhara R-A, Dhaka","1,300 sqft",3,3,35 Thousand,bashundhara r-a,1300,35000.0
16,"Khilgaon, Dhaka","1,200 sqft",3,3,18 Thousand,khilgaon,1200,18000.0
17,"Block K, Baridhara, Dhaka","3,000 sqft",4,4,1.6 Lakh,baridhara,3000,160000.0
18,"Ibrahimpur, Dhaka","1,050 sqft",3,3,25 Thousand,ibrahimpur,1050,25000.0
19,"Ibrahimpur, Dhaka","1,050 sqft",3,3,25 Thousand,ibrahimpur,1050,25000.0
20,"Sector 5, Uttara, Dhaka","1,400 sqft",3,2,30 Thousand,uttara,1400,30000.0
21,"PC Culture Housing, Mohammadpur, Dhaka","1,150 sqft",3,3,19 Thousand,mohammadpur,1150,19000.0
22,"Block D, Bashundhara R-A, Dhaka","2,100 sqft",3,4,40 Thousand,bashundhara r-a,2100,40000.0
23,"Nurer Chala, Badda, Dhaka",800 sqft,2,2,18.63 Thousand,badda,800,18630.0
24,"Block F, Bashundhara R-A, Dhaka",900 sqft,2,2,19 Thousand,bashundhara r-a,900,19000.0
25,"Sector 4, Uttara, Dhaka","1,500 sqft",3,3,32 Thousand,uttara,1500,32000.0
26,"Block D, Bashundhara R-A, Dhaka","1,300 sqft",3,3,60 Thousand,bashundhara r-a,1300,60000.0
27,"Block D, Bashundhara R-A, Dhaka","1,300 sqft",3,3,40 Thousand,bashundhara r-a,1300,40000.0
28,"Block D, Bashundhara R-A, Dhaka","1,300 sqft",3,3,40 Thousand,bashundhara r-a,1300,40000.0
29,"Rajabazar, Tejgaon, Dhaka",650 sqft,2,2,18 Thousand,tejgaon,650,18000.0
30,"Baridhara, Dhaka","1,524 sqft",3,3,1 Lakh,baridhara,1524,100000.0
31,"Khilgaon, Dhaka","1,100 sqft",3,2,19 Thousand,khilgaon,1100,19000.0
32,"Sector 9, Uttara, Dhaka","1,500 sqft",3,4,35 Thousand,uttara,1500,35000.0
33,"Gulshan 1, Gulshan, Dhaka","3,500 sqft",4,4,2 Lakh,gulshan,3500,200000.0
34,"Sector 9, Uttara, Dhaka",850 sqft,2,2,25 Thousand,uttara,850,25000.0
35,"Sector 14, Uttara, Dhaka","1,400 sqft",3,4,32 Thousand,uttara,1400,32000.0
36,"Block D, Section 12, Mirpur, Dhaka",650 sqft,2,2,10 Thousand,mirpur,650,10000.0
37,"Block G, Bashundhara R-A, Dhaka","1,750 sqft",3,4,30 Thousand,bashundhara r-a,1750,30000.0
38,"Baitul Aman Housing Society, Adabor, Dhaka","1,200 sqft",3,2,20 Thousand,adabor,1200,20000.0
39,"Kajla, Jatra Bari, Dhaka",800 sqft,3,2,15 Thousand,jatra bari,800,15000.0
40,"Sector 11, Uttara, Dhaka","1,617 sqft",3,4,30 Thousand,uttara,1617,30000.0
41,"Sector 7, Uttara, Dhaka","1,350 sqft",3,3,27 Thousand,uttara,1350,27000.0
42,"Gulshan 2, Gulshan, Dhaka","1,600 sqft",3,3,50 Thousand,gulshan,1600,50000.0
43,"Sector 10, Uttara, Dhaka","1,900 sqft",3,4,50 Thousand,uttara,1900,50000.0
44,"Block A, Sat Masjid Housing, Mohammadpur, Dhaka",900 sqft,2,3,16 Thousand,mohammadpur,900,16000.0
45,"Block D, Bashundhara R-A, Dhaka","1,300 sqft",3,3,60 Thousand,bashundhara r-a,1300,60000.0
46,"West Malibag, Malibagh, Dhaka",950 sqft,2,2,19 Thousand,malibagh,950,19000.0
47,"Banani, Dhaka","2,600 sqft",3,4,75 Thousand,banani,2600,75000.0
48,"Sector 10, Uttara, Dhaka","1,500 sqft",3,3,24 Thousand,uttara,1500,24000.0
49,"Block A, Bashundhara R-A, Dhaka","1,860 sqft",3,4,38 Thousand,bashundhara r-a,1860,38000.0

In [25]:
df['Price'].isnull().sum()

0

In [26]:
df['avg_rent'].isnull().sum()

0

### Rename Bed and Bath Column

In [27]:
df.rename(columns = {'Bed': 'bedroom', 'Bath': 'bathroom'}, inplace=True)

In [28]:
df.head()

,Location,Area,bedroom,bathroom,Price,location,area_sqft,avg_rent
0,"Block H, Bashundhara R-A, Dhaka","1,600 sqft",3,3,20 Thousand,bashundhara r-a,1600,20000.0
1,"Farmgate, Tejgaon, Dhaka",900 sqft,2,2,20 Thousand,tejgaon,900,20000.0
2,"Block B, Nobodoy Housing Society, Mohammadpur,...","1,250 sqft",3,3,18 Thousand,mohammadpur,1250,18000.0
3,"Gulshan 1, Gulshan, Dhaka","2,200 sqft",3,4,75 Thousand,gulshan,2200,75000.0
4,"Baridhara, Dhaka","2,200 sqft",3,3,75 Thousand,baridhara,2200,75000.0

## Final Dataframe

In [29]:
df_preprocessed = df[['area_sqft', 'bedroom', 'bathroom', 'location', 'avg_rent']]

In [30]:
df_preprocessed.head()

   area_sqft  bedroom  bathroom         location  avg_rent
0       1600        3         3  bashundhara r-a   20000.0
1        900        2         2          tejgaon   20000.0
2       1250        3         3      mohammadpur   18000.0
3       2200        3         4          gulshan   75000.0
4       2200        3         3        baridhara   75000.0

In [31]:
df_preprocessed.shape

(28800, 5)

In [32]:
df_preprocessed.isnull().sum()

area_sqft     0
bedroom       0
bathroom      0
location     13
avg_rent      0
dtype: int64

In [33]:
df_preprocessed.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28800 entries, 0 to 28799
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   area_sqft  28800 non-null  int64
 1   bedroom    28800 non-null  int64
 2   bathroom   28800 non-null  int64
 3   location   28787 non-null  object
 4   avg_rent   28800 non-null  float64
dtypes: float64(1), int64(3), object(1)
memory usage: 1.1+ MB

In [34]:
df_preprocessed.dropna(axis=0, inplace=True)

In [35]:
df_preprocessed.isnull().sum()

area_sqft    0
bedroom      0
bathroom     0
location     0
avg_rent     0
dtype: int64

In [36]:
df_preprocessed.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 28787 entries, 0 to 28799
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   area_sqft  28787 non-null  int64
 1   bedroom    28787 non-null  int64
 2   bathroom   28787 non-null  int64
 3   location   28787 non-null  object
 4   avg_rent   28787 non-null  float64
dtypes: float64(1), int64(3), object(1)
memory usage: 1.3+ MB

## Train Test Split

In [37]:
from sklearn.model_selection import train_test_split

In [38]:
train_df, test_df = train_test_split(df_preprocessed, test_size=0.3, random_state=42)

In [39]:
print(f'train data size: {train_df.shape}')
print(f'test data size: {test_df.shape}')

train data size: (20150, 5)
test data size: (8637, 5)

## Save processed DataFrame

In [40]:
df_preprocessed.to_csv('data_ingestion/processed_data.csv', index=False)
train_df.to_csv('data_ingestion/train_df.csv', index=False)
test_df.to_csv('data_ingestion/test_df.csv', index=False)

### Check loaded or not successfully

In [41]:
new_df = pd.read_csv('data_ingestion/processed_data.csv')
train_df = pd.read_csv('data_ingestion/train_df.csv')
test_df = pd.read_csv('data_ingestion/test_df.csv')

In [42]:
print(new_df.shape)
print(train_df.shape)
print(test_df.shape)

(28787, 5)
(20150, 5)
(8637, 5)

In [43]:
new_df.head()

   area_sqft  bedroom  bathroom         location  avg_rent
0       1600        3         3  bashundhara r-a   20000.0
1        900        2         2          tejgaon   20000.0
2       1250        3         3      mohammadpur   18000.0
3       2200        3         4          gulshan   75000.0
4       2200        3         3        baridhara   75000.0

In [44]:
train_df.head(3)

   area_sqft  bedroom  bathroom      location  avg_rent
0        900        2         2        uttara   18000.0
1       1200        3         3  shahjahanpur   30000.0
2        720        2         2   mohammadpur   17000.0

In [45]:
test_df.head(3)

   area_sqft  bedroom  bathroom location  avg_rent
0        700        2         2    badda   16000.0
1        900        2         2   uttara   17000.0
2        700        2         2   mirpur   15000.0

# Fine!  Everythin is okay